linux/tutorials/tools.org
#+TITLE:     Popular Software Tools in Linux
#+AUTHOR:    WANG Xiaolin
#+EMAIL:     wx672ster@gmail.com
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:nil toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:nil skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+OPTIONS:   author:t creator:t timestamp:t
#+INFOJS_OPT: view:plain toc:nil ltoc:nil mouse:underline buttons:0 path:http://cs2.swfu.edu.cn/org-info-js/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME:

  - Editor :: emacs, vim
    - in emacs, type =C-h t=
    - at shell prompt, type =vimtutor=
  - Remote Access :: ssh, scp, lftp, rdesktop
    - example:
      - remote login: =ssh 20101152888@cs3.swfu.edu.cn=
      - remote copy: 
	- =scp hello.c 20101152888@cs3.swfu.edu.cn:=
	- =scp 20101152888@cs3.swfu.edu.cn:hello.c .=
  - Email :: mutt, mailx
  - Browser :: lynx, elinks, w3m
  - Image Processing :: imagemagick, qiv, Gimp, inkscape, recordmydesktop
  - Office Suites :: Openoffice.org, koffice, gnome office
  - Visual Programming :: Qt4designer, Netbeans, Eclipse, glade, Gambas
  - Graph Drawing :: Dia, Xfig, umbrello
  - Scintific Computing :: Octave, Scilab, Gnuplot, Maxima
  - Multimedia :: mpg123, mplayer, vlc, totem, rythmbox
