linux/tutorials/tools.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Popular Software Tools in Linux</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Popular Software Tools in Linux"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-08-27T21:41+0800"/>
<meta name="author" content="WANG Xiaolin"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="http://cs2.swfu.edu.cn/org-info-js/org-manual.css" type="text/css">

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Popular Software Tools in Linux</h1>

<dl>
<dt>Editor</dt><dd>emacs, vim
<ul>
<li>in emacs, type <code>C-h t</code>
</li>
<li>at shell prompt, type <code>vimtutor</code>
</li>
</ul>

</dd>
<dt>Remote Access</dt><dd>ssh, scp, lftp, rdesktop
<ul>
<li>example:
<ul>
<li>remote login: <code>ssh 20101152888@cs3.swfu.edu.cn</code>
</li>
<li>remote copy: 
<ul>
<li><code>scp hello.c 20101152888@cs3.swfu.edu.cn:</code>
</li>
<li><code>scp 20101152888@cs3.swfu.edu.cn:hello.c .</code>
</li>
</ul>

</li>
</ul>

</li>
</ul>

</dd>
<dt>Email</dt><dd>mutt, mailx
</dd>
<dt>Browser</dt><dd>lynx, elinks, w3m
</dd>
<dt>Image Processing</dt><dd>imagemagick, qiv, Gimp, inkscape, recordmydesktop
</dd>
<dt>Office Suites</dt><dd>Openoffice.org, koffice, gnome office
</dd>
<dt>Visual Programming</dt><dd>Qt4designer, Netbeans, Eclipse, glade, Gambas
</dd>
<dt>Graph Drawing</dt><dd>Dia, Xfig, umbrello
</dd>
<dt>Scintific Computing</dt><dd>Octave, Scilab, Gnuplot, Maxima
</dd>
<dt>Multimedia</dt><dd>mpg123, mplayer, vlc, totem, rythmbox
</dd>
</dl>

</div>

<div id="postamble">
<p class="author">Author: WANG Xiaolin (<a href="mailto:wx672ster@gmail.com">wx672ster@gmail.com</a>)</p>
<p class="date">Date: 2013-08-27T21:41+0800</p>

</div>
</body>
</html>
